Revit 2026 API

# HardwoodHardwoodImperfectionsShader Property

---

The property labeled "Image" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string HardwoodImperfectionsShader { get; }
```
```vb
Public Shared ReadOnly Property HardwoodImperfectionsShader As String
	Get
```
```cpp
public:
static property String^ HardwoodImperfectionsShader {
	String^ get ();
}
```
```fsharp
static member HardwoodImperfectionsShader : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

Hardwood Class

Autodesk.Revit.DB.Visual Namespace